Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ОН/ДанныеВебКабинетаСУО_ОН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУО_ОН</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ФотографииПользователейСУО/ФотографииПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФотографииПользователейСУО</name>
  <resources>
    <name>ЕстьАватар</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Аватар</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/НастройкиПользователейСУО/НастройкиПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователейСУО</name>
  <attributes>
    <name>СкрытьКонтактнуюИнформацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьДополнительныеСведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРассылкуНаАдресЭлектроннойПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьУведомленияОНовыхЛичныхСообщениях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьУведомленияОНовыхСообщенияхФорума</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/СтудентыОО/СтудентыОО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтудентыОО</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Курс</name>
    <type>
      <types>CatalogRef.КурсыОО</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыСтудентовОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Специализация</name>
    <type>
      <types>CatalogRef.СпециализацииОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Специальность</name>
    <type>
      <types>CatalogRef.СпециальностиОО</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбученияОО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отделение</name>
    <type>
      <types>CatalogRef.ОтделенияОО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыДанныхВебКабинетаСУО/ТипыДанныхВебКабинетаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДанныхВебКабинетаСУО</name>
  <enumValues>
    <name>УчебнаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>РезультатыТестирования</name>
  </enumValues>
  <enumValues>
    <name>УчастникОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеЗаявки</name>
  </enumValues>
  <enumValues>
    <name>РазделФорума</name>
  </enumValues>
  <enumValues>
    <name>РазделФорумаОписание</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщения</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщенияОписание</name>
  </enumValues>
  <enumValues>
    <name>Сообщение</name>
  </enumValues>
  <enumValues>
    <name>СообщениеОписание</name>
  </enumValues>
  <enumValues>
    <name>Организатор</name>
  </enumValues>
  <enumValues>
    <name>БиблиотекаПользователя</name>
  </enumValues>
  <enumValues>
    <name>Новость</name>
  </enumValues>
  <enumValues>
    <name>НовостьОписание</name>
  </enumValues>
  <enumValues>
    <name>КнигаОписание</name>
  </enumValues>
  <enumValues>
    <name>КаталогПользователей</name>
  </enumValues>
  <enumValues>
    <name>ПользовательОписание</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппа</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппаОписание</name>
  </enumValues>
  <enumValues>
    <name>ФайлУчащегося</name>
  </enumValues>
  <enumValues>
    <name>ПреподавателиПользователя</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>ОценкиКачестваОбучения</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ФорматыВебДанныхСУ/ФорматыВебДанныхСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматыВебДанныхСУ</name>
  <enumValues>
    <name>xml</name>
  </enumValues>
  <enumValues>
    <name>json</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПрохождениеОбученияСУО/ПрохождениеОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрохождениеОбученияСУО</name>
  <registerRecords>InformationRegister.РасписаниеОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ФайлыНаПроверкуПреподавателюСУО</registerRecords>
  <registerRecords>InformationRegister.УчастникиОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.ОценкиКачестваОбученияСУО</registerRecords>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <registerRecords>InformationRegister.ПрохожденияОбученияСУО</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПрохождение</name>
    <type>
      <types>DocumentRef.ПрохождениеОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаОбучениеСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <comment>Только для электронного обучения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращеноНаДоработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоВремениСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаКачестваОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКачестваОбучения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОцениванияКачестваОбучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставленаОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/CommonModules/ВебКабинетСУО/Module.bsl
// Подписки на события элементов
//

Процедура ДанныеВебКабинетаОбновлениеДокументовСУООбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Приоритет = 3;
	
	Если Источник.ДополнительныеСвойства.Свойство("ЭтоПерепроведение")
		И Источник.ДополнительныеСвойства.ЭтоПерепроведение Тогда
		
		Если Источник.ДополнительныеСвойства.Свойство("Важность") Тогда		
			Приоритет = Источник.ДополнительныеСвойства.Важность - 1;
		Иначе
			Приоритет = 2;			
		КонецЕсли; 
		
		Если Приоритет < 2 Тогда
			Приоритет = 2
		КонецЕсли;
		
	КонецЕсли;
	
	
	Если Источник.ДополнительныеСвойства.Свойство("ПриПрохожденииОбучения")
		И Источник.ДополнительныеСвойства.ПриПрохожденииОбучения Тогда
		
		Приоритет = 5;
		
	КонецЕсли;
	
	ДобавитьЗаданиеНаОбновлениеДанныеСсылочногоТипа(Источник, Приоритет);
	
КонецПроцедуры

Процедура ДанныеВебКабинетаУдалениеДокументовСУООбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	ДобавитьЗаданиеНаОбновлениеДанныеСсылочногоТипа(Источник, 1);
	
КонецПроцедуры

Процедура ДанныеВебКабинетаОбновлениеОбъектовСУОПриЗаписи(Источник, Отказ) Экспорт
	
	ДобавитьЗаданиеНаОбновлениеДанныеСсылочногоТипа(Источник, 1);
	
КонецПроцедуры

Процедура ДанныеВебКабинетаОбновлениеРегистровСУОПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ВебКабинетСУ.Используется() Тогда
		Возврат;
	КонецЕсли;	
	
	Если Источник.ДополнительныеСвойства.Свойство("НеОбновлятьДанныеВебКабинета")
		И Источник.ДополнительныеСвойства.НеОбновлятьДанныеВебКабинета Тогда
		Возврат;
	КонецЕсли;	
	
	ИмяРегистра = Источник.Метаданные().Имя;
	
	ПараметрыФЗ = Новый Массив;
	ПараметрыФЗ.Добавить(Источник.Отбор);
	
	Если Источник.ДополнительныеСвойства.Свойство("ОбновитьДанныеВебКабинетаВТранзакции")
		И Источник.ДополнительныеСвойства.ОбновитьДанныеВебКабинетаВТранзакции Тогда
		
		ВебКабинетСУ.ОбновитьДанныеЗаписи(Источник.Отбор, ИмяРегистра);
		
	Иначе
		
		ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных(ИмяРегистра, "ВебКабинетСУ.ОбновитьДанныеЗаписи", ПараметрыФЗ, Новый УникальныйИдентификатор(), 1);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ГруппыПользователейВебКабинетаОбновлениеСУОПриЗаписи(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ВебКабинетСУ.Используется() Тогда
		Возврат;
	КонецЕсли;	
	
	Если Источник.ДополнительныеСвойства.Свойство("НеОбновлятьДанныеВебКабинета")
		И Источник.ДополнительныеСвойства.НеОбновлятьДанныеВебКабинета Тогда
		Возврат;
	КонецЕсли;	
	
	ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных("Справочник.Пользователи", "ВебКабинетСУО.ОбновитьКаталогПользователейВебКабинета", Неопределено, Строка(Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000")));
	
КонецПроцедуры

Процедура ДобавитьЗаданиеНаОбновлениеДанныеСсылочногоТипа(Источник, Приоритет)
	
	Если НЕ ВебКабинетСУ.Используется() Тогда
		Возврат;
	КонецЕсли;		
	
	Если Источник.ДополнительныеСвойства.Свойство("НеОбновлятьДанныеВебКабинета")
		И Источник.ДополнительныеСвойства.НеОбновлятьДанныеВебКабинета Тогда
		Возврат;
	КонецЕсли;		
	
	Если Источник.ДополнительныеСвойства.Свойство("РаспределитьОбновлениеВебКабинетаПоПользователям")
		И Источник.ДополнительныеСвойства.РаспределитьОбновлениеВебКабинетаПоПользователям
		И Источник.ДополнительныеСвойства.Свойство("ПользователиПослеЗаписи")
		И Источник.ДополнительныеСвойства.Свойство("ПользователиДоЗаписи")
		И Источник.ДополнительныеСвойства.Свойство("ИмяОбъектаМетаданныхОбновленияВебКабинета") Тогда
		
		УникальныеПользователи = Источник.ДополнительныеСвойства.ПользователиДоЗаписи;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(УникальныеПользователи, Источник.ДополнительныеСвойства.ПользователиПослеЗаписи, Истина); 
		
		ТекущийИндекс = 0;
		ЧислоПользователей = УникальныеПользователи.Количество();
		ТекущаяПорция = Новый Массив;
		РазмерПорции = 60;
		
		Пока ТекущийИндекс < ЧислоПользователей Цикл
			
			ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
			
			Пока ТекущаяПорция.Количество() < РазмерПорции И ТекущийИндекс < ЧислоПользователей Цикл
				ТекущийПользователь = УникальныеПользователи[ТекущийИндекс]; 
				ТекущаяПорция.Добавить(ТекущийПользователь);
				ХешированиеДанных.Добавить(Строка(ТекущийПользователь.УникальныйИдентификатор()));
				ТекущийИндекс = ТекущийИндекс + 1;
			КонецЦикла;
			
			Параметры = Новый Массив;
			Параметры.Добавить(ТекущаяПорция);
			Параметры.Добавить(Неопределено);
			
			КлючЗадания = СтрЗаменить(ХешированиеДанных.ХешСумма, " ", "");
			
			ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных(
				Источник.ДополнительныеСвойства.ИмяОбъектаМетаданныхОбновленияВебКабинета,
				"ВебКабинетСУ.ОбновитьДанныеОбъекта", Параметры, КлючЗадания);							
			
			ТекущаяПорция = Новый Массив;
			
		КонецЦикла;
		
	Иначе
		
		Если Источник.ДополнительныеСвойства.Свойство("ОбновитьДанныеВебКабинетаВТранзакции")
			И Источник.ДополнительныеСвойства.ОбновитьДанныеВебКабинетаВТранзакции Тогда
			
			ВебКабинетСУ.ОбновитьДанныеОбъекта(
				ОбщегоНазначения.МенеджерОбъектаПоСсылке(Источник.Ссылка),
				Источник.Ссылка,
				Источник.ДополнительныеСвойства);
			
		Иначе
			
			ПараметрыФЗ = Новый Массив;
			ПараметрыФЗ.Добавить(Источник.Ссылка);
			ПараметрыФЗ.Добавить(Источник.ДополнительныеСвойства); // Используется, например, для передачи параметра ПользователиДоЗаписи
			
			ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных(ОбщегоНазначения.ИмяТаблицыПоСсылке(Источник.Ссылка), "ВебКабинетСУ.ОбновитьДанныеОбъекта", ПараметрыФЗ, Строка(Источник.Ссылка.УникальныйИдентификатор()), Приоритет); 
			
		КонецЕсли;
		
	КонецЕсли;		
	
КонецПроцедуры

// Выгрузка файлов объектов и общих файлов
//

Процедура ВыгрузитьФайлыФорматированногоДокументаВКаталогВебКабинета(ДвоичныеДанныеФайла, ИдентификаторКаталога) Экспорт
		
	Если ДвоичныеДанныеФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторКаталога) Тогда
		Возврат;
	КонецЕсли;
	
	ПутьККаталогуРесурса = ВебКабинетСУ.ПутьККаталогуКартинок(ОбъектыСУЗПовтИсп.ПутьКОбщемуКаталогу());	
	ПутьККаталогуРесурса = ПутьККаталогуРесурса + ИдентификаторКаталога;
	ПутьККаталогуРесурса = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогуРесурса);
	
	СоздатьКаталог(ПутьККаталогуРесурса);		
	
	ПутьКАрхивуСДаннымиРесурса = ПутьККаталогуРесурса + "data.zip"; 
	
	ДвоичныеДанныеФайла.Записать(ПутьКАрхивуСДаннымиРесурса);
	
	Архиватор = Новый ЧтениеZipФайла(ПутьКАрхивуСДаннымиРесурса);
		
	Архиватор.ИзвлечьВсе(ПутьККаталогуРесурса, РежимВосстановленияПутейФайловZIP.Восстанавливать);
		
	УдалитьФайлы(ПутьКАрхивуСДаннымиРесурса);		

КонецПроцедуры

Функция ПолноеИмяОбщегоФайлаВебКабинета(Файл, ПутьККаталогуФайла, ДанныеФайла=Неопределено) Экспорт
	
	Если ДанныеФайла = Неопределено Тогда
		ДанныеФайла = РаботаСФайламиСлужебныйВызовСервера.ДанныеФайла(Файл);
	КОнецЕсли;
	
	Возврат ПутьККаталогуФайла + ДанныеФайла.ПолноеНаименованиеВерсии + "." + ДанныеФайла.Расширение;
	
КонецФункции

// Каталог и описание пользователей
//

Процедура ОбновитьДанныеПользователяВебКабинета(Пользователь, ДополнительныеДанные = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ОписаниеПользователяJSON = ПользовательОписаниеJSON(Пользователь);
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(Пользователь, Перечисления.ТипыДанныхВебКабинетаСУО.ПользовательОписание);
	РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.ПользовательОписание, Пользователь, ОписаниеПользователяJSON, Перечисления.ФорматыВебДанныхСУ.json);
	
КонецПроцедуры

Процедура ОбновитьКаталогПользователейВебКабинета() Экспорт

	РегистрыСведений.ДанныеВебКабинетаСУО_ОН.УдалитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.КаталогПользователей, Перечисления.ТипыДанныхВебКабинетаСУО.КаталогПользователей);
	
	Если Справочники.ПубликацииВебКабинетаСУ.ДоступенПолныйКаталогПользователей() Тогда
		РегистрыСведений.ДанныеВебКабинетаСУО_ОН.ДобавитьДанные(Перечисления.ТипыДанныхВебКабинетаСУО.КаталогПользователей, Перечисления.ТипыДанныхВебКабинетаСУО.КаталогПользователей, КаталогПользователейJSON(), Перечисления.ФорматыВебДанныхСУ.json);
	КонецЕсли;
	
КонецПроцедуры

Функция КаталогПользователейJSON() Экспорт
	
	КаталогПользователей = Новый Структура("ГруппыПользователей, Пользователи", Новый Массив, Новый Массив);
	
	// Получаем группы пользователей
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыПользователей.Ссылка,
		|	ГруппыПользователей.Родитель,
		|	ГруппыПользователей.Наименование,
		|	ГруппыПользователей.ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.ГруппыПользователей КАК ГруппыПользователей
		|ГДЕ
		|	ГруппыПользователей.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ГруппаПользователей = Новый Структура("Идентификатор, Родитель, Наименование, ИмяПредопределенныхДанных",
			Строка(ВыборкаДетальныеЗаписи.Ссылка.УникальныйИдентификатор()),
			Строка(ВыборкаДетальныеЗаписи.Родитель.УникальныйИдентификатор()),
			ВыборкаДетальныеЗаписи.Наименование,
			ВыборкаДетальныеЗаписи.ИмяПредопределенныхДанных);
			
		КаталогПользователей.ГруппыПользователей.Добавить(ГруппаПользователей);
			
	КонецЦикла;
	
	// Получаем пользователей
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоставыГруппПользователей.ГруппаПользователей,
		|	СоставыГруппПользователей.Пользователь,
		|	СоставыГруппПользователей.Пользователь.Наименование КАК НаименованиеПользователя,
		|	ВЫБОР
		|		КОГДА ФотографииПользователейСУО.ЕстьАватар ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ФотографииПользователейСУО.ЕстьАватар
		|	КОНЕЦ КАК ЕстьАватар
		|ИЗ
		|	РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФотографииПользователейСУО КАК ФотографииПользователейСУО
		|		ПО СоставыГруппПользователей.Пользователь = ФотографииПользователейСУО.Пользователь
		|ГДЕ
		|	СоставыГруппПользователей.Используется = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПользовательСтруктура = ПользовательСтруктура(ВыборкаДетальныеЗаписи.Пользователь, ВыборкаДетальныеЗаписи.НаименованиеПользователя, ВыборкаДетальныеЗаписи.ЕстьАватар);
		ПользовательСтруктура.Вставить("Группа", Строка(ВыборкаДетальныеЗаписи.ГруппаПользователей.УникальныйИдентификатор()));
			
		КаталогПользователей.Пользователи.Добавить(ПользовательСтруктура);
			
	КонецЦикла;

	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(КаталогПользователей);
	
КонецФункции

Функция ПользовательОписаниеJSON(Знач Пользователь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПользовательОписание = Новый Структура("Идентификатор, Наименование, КонтактнаяИнформация, ДополнительныеСведения, Фотография, Аватар, ИнформацияОСтуденте, Недействителен");
	ДанныеПользователя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Пользователь, "Наименование, Недействителен");
	
	// Общие данные
	
	ПользовательОписание.Идентификатор = Строка(Пользователь.УникальныйИдентификатор());
	ПользовательОписание.Наименование = ДанныеПользователя.Наименование;
	ПользовательОписание.Недействителен = ДанныеПользователя.Недействителен;	
	
	// Контакты
	
	СкрытьКонтактнуюИнформацию = РегистрыСведений.НастройкиПользователейСУО.ПолучитьНастройку(Пользователь, "СкрытьКонтактнуюИнформацию");
	
	Если СкрытьКонтактнуюИнформацию = Неопределено ИЛИ НЕ СкрытьКонтактнуюИнформацию Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПользователиКонтактнаяИнформация.Тип,
			|	ПользователиКонтактнаяИнформация.Вид,
			|	ПользователиКонтактнаяИнформация.Вид.Наименование КАК НаименованиеВида,
			|	ПользователиКонтактнаяИнформация.Представление,
			|	ПользователиКонтактнаяИнформация.ЗначенияПолей,
			|	ПользователиКонтактнаяИнформация.Страна,
			|	ПользователиКонтактнаяИнформация.Регион,
			|	ПользователиКонтактнаяИнформация.Город,
			|	ПользователиКонтактнаяИнформация.АдресЭП,
			|	ПользователиКонтактнаяИнформация.ДоменноеИмяСервера,
			|	ПользователиКонтактнаяИнформация.НомерТелефона,
			|	ПользователиКонтактнаяИнформация.НомерТелефонаБезКодов
			|ИЗ
			|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
			|ГДЕ
			|	ПользователиКонтактнаяИнформация.Ссылка = &Пользователь
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПользователиКонтактнаяИнформация.Вид.РеквизитДопУпорядочивания";
		
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		
		ПользовательОписание.КонтактнаяИнформация = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	// Дополнительные реквизиты
	
	СкрытьДополнительныеСведения = РегистрыСведений.НастройкиПользователейСУО.ПолучитьНастройку(Пользователь, "СкрытьДополнительныеСведения");
	
	Если СкрытьДополнительныеСведения = Неопределено ИЛИ НЕ СкрытьДополнительныеСведения Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПользователиДополнительныеРеквизиты.Свойство,
			|	ПользователиДополнительныеРеквизиты.Значение,
			|	ПользователиДополнительныеРеквизиты.ТекстоваяСтрока,
			|	ПользователиДополнительныеРеквизиты.Свойство.Заголовок КАК Наименование,
			|	ПользователиДополнительныеРеквизиты.Свойство.ТипЗначения КАК ТипЗначения,
			|	ПользователиДополнительныеРеквизиты.Свойство.ФорматСвойства КАК ФорматСвойства
			|ИЗ
			|	Справочник.Пользователи.ДополнительныеРеквизиты КАК ПользователиДополнительныеРеквизиты
			|ГДЕ
			|	ПользователиДополнительныеРеквизиты.Ссылка = &Пользователь";
		
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		
		ПользовательОписание.ДополнительныеСведения = Запрос.Выполнить().Выгрузить();
		
		Для каждого Строка Из ПользовательОписание.ДополнительныеСведения Цикл
			
			Если ТипЗнч(Строка.Значение) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") Тогда
				Строка.Значение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Значение, "Наименование");
			КонецЕсли;
			
			Если ТипЗнч(Строка.Значение) = Тип("Дата") Тогда
				
				Если НЕ ЗначениеЗаполнено(Строка.ФорматСвойства) Тогда
					Строка.ФорматСвойства = "ДЛФ=D";
				КонецЕсли;				
				
				Строка.Значение = Формат(Строка.Значение, Строка.ФорматСвойства);
				
			КонецЕсли;
		
		КонецЦикла;
	
	КонецЕсли;	
	
	// Фотография и аватар
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФотографииПользователейСУО.Фотография,
		|	ФотографииПользователейСУО.Аватар
		|ИЗ
		|	РегистрСведений.ФотографииПользователейСУО КАК ФотографииПользователейСУО
		|ГДЕ
		|	ФотографииПользователейСУО.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();

		ДвоичныеДанныеФотографии = ВыборкаДетальныеЗаписи.Фотография.Получить(); 
		
		Если ДвоичныеДанныеФотографии <> Неопределено Тогда
			
			ИмяФайлаФотографии = РегистрыСведений.ФотографииПользователейСУО.ИмяФайлаФотографии(ДвоичныеДанныеФотографии);
			
			ПользовательОписание.Фотография = ПользовательОписание.Идентификатор + "/" + ИмяФайлаФотографии;
			
		КонецЕсли;
		
		ДвоичныеДанныеАватара = ВыборкаДетальныеЗаписи.Аватар.Получить(); 
		
		Если ДвоичныеДанныеАватара <> Неопределено Тогда
			ИмяФайлаАватара = РегистрыСведений.ФотографииПользователейСУО.ИмяФайлаАватара();
			ПользовательОписание.Аватар = ПользовательОписание.Идентификатор + "/" + ИмяФайлаАватара;
		КонецЕсли;		

	КонецЕсли;
	
	// Свойства студента
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСтудентовСУО") Тогда	
		ПользовательОписание.ИнформацияОСтуденте = РегистрыСведений.СтудентыОО.СвойстваСтудентаСтруктура(Пользователь);
	КонецЕсли;
	
	Возврат ОбщегоНазначенияСУ.ДанныеВJSON(ПользовательОписание);
	
КонецФункции

Функция ПользовательСтруктура(Знач Пользователь, Знач Наименование = Неопределено, Знач ЕстьАватар = Неопределено) Экспорт
	
	Если Наименование = Неопределено Тогда
		Наименование = Общегоназначения.ЗначениеРеквизитаОбъекта(Пользователь, "Наименование");
	КонецЕсли;
	
	Если ТипЗнч(ЕстьАватар) <> Тип("Булево") Тогда
		ЕстьАватар = РегистрыСведений.ФотографииПользователейСУО.ЕстьАватар(Пользователь);
	КонецЕсли;
	
	ОписаниеПользователя = Новый Структура();
	
	ОписаниеПользователя.Вставить("Наименование", Наименование);
	ОписаниеПользователя.Вставить("Идентификатор", Строка(Пользователь.УникальныйИдентификатор()));
	ОписаниеПользователя.Вставить("Аватар", ?(ЕстьАватар, Строка(Пользователь.УникальныйИдентификатор()) + "/" + РегистрыСведений.ФотографииПользователейСУО.ИмяФайлаАватара(), ""));
	
	Возврат ОписаниеПользователя;
	
КонецФункции

// Структуры данных

Функция ТаблицаДополнительныхРеквизитовОбъекта(СсылкаНаОбъект) Экспорт
	
	// Получаем дополнительные сведения
	//
	
	МассивРеквизитов = УправлениеСвойствами.СвойстваОбъекта(СсылкаНаОбъект, Истина, Ложь);
	
	ТаблицаЗначений = УправлениеСвойствами.ЗначенияСвойств(СсылкаНаОбъект, Истина, Ложь, МассивРеквизитов);
	
	ЗапросДанных = Новый Запрос;
	ЗапросДанных.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеРеквизитыИСведения.Заголовок КАК Наименование,
		|	ДополнительныеРеквизитыИСведения.ТипЗначения КАК Тип,
		|	ДополнительныеРеквизитыИСведения.МногострочноеПолеВвода,
		|	ДополнительныеРеквизитыИСведения.ФорматСвойства,
		|	ДополнительныеРеквизитыИСведения.Ссылка КАК Свойство,
		|	ДополнительныеРеквизитыИСведения.Подсказка
		|ИЗ
		|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
		|ГДЕ
		|	ДополнительныеРеквизитыИСведения.Ссылка В(&МассивРеквизитов)";
	
	ЗапросДанных.УстановитьПараметр("МассивРеквизитов", МассивРеквизитов);
	
	ТаблицаРеквизитов = ЗапросДанных.Выполнить().Выгрузить();
	
	ТаблицаРеквизитов.Колонки.Добавить("Значение");
	ТаблицаРеквизитов.Колонки.Добавить("Варианты");
	ТаблицаРеквизитов.Колонки.Добавить("ТипЗначения");
	ТаблицаРеквизитов.Колонки.Добавить("ТекстоваяСтрока");
	
	Для каждого Строка Из ТаблицаРеквизитов Цикл
		
		Если Строка.Тип.СодержитТип(Тип("СправочникСсылка.ЗначенияСвойствОбъектов")) Тогда
			
			Строка.ТипЗначения = "Свойства";
				
			ЗапросДанных = Новый Запрос;
			ЗапросДанных.Текст = 
				"ВЫБРАТЬ
				|	ЗначенияСвойствОбъектов.Ссылка КАК Значение,
				|	ЗначенияСвойствОбъектов.Наименование
				|ИЗ
				|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
				|ГДЕ
				|	ЗначенияСвойствОбъектов.Владелец = &Свойство
				|	И ЗначенияСвойствОбъектов.ПометкаУдаления = ЛОЖЬ
				|	И ЗначенияСвойствОбъектов.ЭтоГруппа = ЛОЖЬ";
			
			ЗапросДанных.УстановитьПараметр("Свойство", Строка.Свойство);
			
			Строка.Варианты = ЗапросДанных.Выполнить().Выгрузить();
			
		Иначе
			
			Строка.ТипЗначения = Строка(Строка.Тип);
			Строка.Варианты = NULL;

		КонецЕсли;		
		
		ЗначениеРеквизита = ТаблицаЗначений.Найти(Строка.Свойство, "Свойство");
		
		Если ЗначениеРеквизита = Неопределено Тогда
			
			Строка.Значение = NULL;
			Строка.ТекстоваяСтрока = "";
						
		Иначе
			
			Строка.Значение = ЗначениеРеквизита.Значение;
			Строка.ТекстоваяСтрока = Строка(ЗначениеРеквизита.Значение);
			
			Если ТипЗнч(Строка.Значение) = Тип("Дата") Тогда
				Строка.Значение = Формат(Строка.Значение, "ДФ=yyyy-MM-dd");  //ISO 8601 format
			КонецЕсли;			
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаРеквизитов.Колонки.Удалить("Тип");
	
	Возврат ТаблицаРеквизитов; 
	
КонецФункции

// Обучение

Процедура ОбновитьДанныеПрохожденияОбученияВебКабинета(ПрохождениеОбучения, ОписаниеПрохождения) Экспорт
	
	ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.ПрохождениеОбученияСУО, ПрохождениеОбучения);
	
	Если ЗначениеЗаполнено(ОписаниеПрохождения.СледующееПрохождение) Тогда
		ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.ПрохождениеОбученияСУО, ОписаниеПрохождения.СледующееПрохождение);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ОписаниеПрохождения.РодительскоеПрохождение) Тогда
		ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.ПрохождениеОбученияСУО, ОписаниеПрохождения.РодительскоеПрохождение);
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ОписаниеПрохождения.Сертификат) Тогда
		ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.СертификатСУО, ОписаниеПрохождения.Сертификат);
	КонецЕсли;	
	
	Если ОписаниеПрохождения.ОписаниеРодительскогоПрохождения <> Неопределено
		И ЗначениеЗаполнено(ОписаниеПрохождения.ОписаниеРодительскогоПрохождения.Сертификат) Тогда
		ВебКабинетСУ.ОбновитьДанныеОбъекта(Документы.СертификатСУО, ОписаниеПрохождения.ОписаниеРодительскогоПрохождения.Сертификат);		
	КонецЕсли;
	
КонецПроцедуры
